results/ycsb/4-nodes/6-clients/couchbase2/workloadc_couchbase_custom-validation/results-60.txt
[OVERALL], RunTime(ms), 150237
[OVERALL], Throughput(ops/sec), 665.6149949746068
[TOTAL_GCS_G1_Young_Generation], Count, 40
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1301
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.8659651084619635
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 40
[TOTAL_GC_TIME], Time(ms), 1301
[TOTAL_GC_TIME_%], Time(%), 0.8659651084619635
[CLEANUP], Operations, 60
[CLEANUP], AverageLatency(us), 0.6166666666666667
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 5
[CLEANUP], 0, 1.3333333333333333
[CLEANUP], 1000, 1.0
[CLEANUP], 3000, 0.5714285714285714
[CLEANUP], 4000, 0.5925925925925926
[CLEANUP], 5000, 0.3888888888888889
[CLEANUP], 6000, 1.25
[UPDATE], Operations, 5036
[UPDATE], AverageLatency(us), 14667.769062748213
[UPDATE], MinLatency(us), 195
[UPDATE], MaxLatency(us), 5061170
[UPDATE], Return=OK, 5036
[UPDATE], 0, 1534030.0
[UPDATE], 1000, 163509.08333333334
[UPDATE], 2000, 20698.785714285714
[UPDATE], 3000, 28898.558139534885
[UPDATE], 4000, 10172.032258064517
[UPDATE], 5000, 13064.021739130434
[UPDATE], 6000, 12915.7
[UPDATE], 7000, 476677.1458333333
[UPDATE], 8000, 10059.28125
[UPDATE], 9000, 10833.323529411764
[UPDATE], 10000, 11076.888888888889
[UPDATE], 11000, 13156.684210526315
[UPDATE], 12000, 7225.16
[UPDATE], 13000, 11575.565217391304
[UPDATE], 14000, 10955.405405405405
[UPDATE], 15000, 12276.648648648648
[UPDATE], 16000, 8336.702702702703
[UPDATE], 17000, 33949.275862068964
[UPDATE], 18000, 9105.117647058823
[UPDATE], 19000, 9952.064516129032
[UPDATE], 20000, 7362.1875
[UPDATE], 21000, 11449.029411764706
[UPDATE], 22000, 4727.5625
[UPDATE], 23000, 23676.08108108108
[UPDATE], 24000, 10850.880952380952
[UPDATE], 25000, 8989.64705882353
[UPDATE], 26000, 5546.829268292683
[UPDATE], 27000, 7671.625
[UPDATE], 28000, 8133.418604651163
[UPDATE], 29000, 7210.8387096774195
[UPDATE], 30000, 6977.2
[UPDATE], 31000, 7608.818181818182
[UPDATE], 32000, 8332.30612244898
[UPDATE], 33000, 27035.0
[UPDATE], 34000, 5408.711111111111
[UPDATE], 35000, 6551.238095238095
[UPDATE], 36000, 6503.735849056604
[UPDATE], 37000, 10623.84375
[UPDATE], 38000, 5045.625
[UPDATE], 39000, 4367.0
[UPDATE], 40000, 7492.361111111111
[UPDATE], 41000, 7189.72
[UPDATE], 42000, 6510.5641025641025
[UPDATE], 43000, 8292.361111111111
[UPDATE], 44000, 7256.882352941177
[UPDATE], 45000, 8488.925925925925
[UPDATE], 46000, 9234.107142857143
[UPDATE], 47000, 5891.75
[UPDATE], 48000, 8019.794117647059
[UPDATE], 49000, 6768.583333333333
[UPDATE], 50000, 5988.558823529412
[UPDATE], 51000, 7167.0625
[UPDATE], 52000, 8747.04
[UPDATE], 53000, 11295.724137931034
[UPDATE], 54000, 8494.260869565218
[UPDATE], 55000, 5433.825
[UPDATE], 56000, 27305.02380952381
[UPDATE], 57000, 19696.0
[UPDATE], 58000, 7227.972972972973
[UPDATE], 59000, 8674.135135135135
[UPDATE], 60000, 5874.0526315789475
[UPDATE], 61000, 7348.977777777778
[UPDATE], 62000, 5500.306122448979
[UPDATE], 63000, 7067.659090909091
[UPDATE], 64000, 6763.677966101695
[UPDATE], 65000, 5146.679245283019
[UPDATE], 66000, 7563.607843137255
[UPDATE], 67000, 4807.0
[UPDATE], 68000, 6030.620689655172
[UPDATE], 69000, 6708.923076923077
[UPDATE], 70000, 14017.925
[UPDATE], 71000, 7077.868421052632
[UPDATE], 72000, 6416.51282051282
[UPDATE], 73000, 6720.862068965517
[UPDATE], 74000, 6112.444444444444
[UPDATE], 75000, 9702.653846153846
[UPDATE], 76000, 11615.18918918919
[UPDATE], 77000, 16368.038461538461
[UPDATE], 78000, 7064.416666666667
[UPDATE], 79000, 6735.866666666667
[UPDATE], 80000, 8238.484848484848
[UPDATE], 81000, 6877.057142857143
[UPDATE], 82000, 4754.055555555556
[UPDATE], 83000, 11346.035714285714
[UPDATE], 84000, 9198.526315789473
[UPDATE], 85000, 7018.416666666667
[UPDATE], 86000, 5603.619047619048
[UPDATE], 87000, 65366.5
[UPDATE], 88000, 5797.978723404255
[UPDATE], 89000, 4931.51282051282
[UPDATE], 90000, 6044.078947368421
[UPDATE], 91000, 5021.6551724137935
[UPDATE], 92000, 6530.333333333333
[UPDATE], 93000, 4834.95744680851
[UPDATE], 94000, 5398.777777777777
[UPDATE], 95000, 5772.6
[UPDATE], 96000, 6202.934782608696
[UPDATE], 97000, 6844.172413793103
[UPDATE], 98000, 5427.771929824561
[UPDATE], 99000, 10222.347826086956
[UPDATE], 100000, 7031.458333333333
[UPDATE], 101000, 8977.538461538461
[UPDATE], 102000, 11499.027777777777
[UPDATE], 103000, 6641.0344827586205
[UPDATE], 104000, 9622.21052631579
[UPDATE], 105000, 6358.815789473684
[UPDATE], 106000, 5813.136363636364
[UPDATE], 107000, 6829.674418604651
[UPDATE], 108000, 6043.90243902439
[UPDATE], 109000, 6328.931034482759
[UPDATE], 110000, 4622.175
[UPDATE], 111000, 5182.121212121212
[UPDATE], 112000, 5155.205882352941
[UPDATE], 113000, 5330.233333333334
[UPDATE], 114000, 7906.461538461538
[UPDATE], 115000, 6201.388888888889
[UPDATE], 116000, 5405.03125
[UPDATE], 117000, 8114.911764705882
[UPDATE], 118000, 5240.7
[UPDATE], 119000, 8220.853658536585
[UPDATE], 120000, 10867.805555555555
[UPDATE], 121000, 5001.878048780488
[UPDATE], 122000, 6582.361111111111
[UPDATE], 123000, 7060.027027027027
[UPDATE], 124000, 8478.130434782608
[UPDATE], 125000, 4573.454545454545
[UPDATE], 126000, 8457.378378378378
[UPDATE], 127000, 8890.592592592593
[UPDATE], 128000, 5881.434782608696
[UPDATE], 129000, 6399.030303030303
[UPDATE], 130000, 6844.384615384615
[UPDATE], 131000, 7740.34375
[UPDATE], 132000, 5176.380952380952
[UPDATE], 133000, 12645.85294117647
[UPDATE], 134000, 5770.6578947368425
[UPDATE], 135000, 6070.780487804878
[UPDATE], 136000, 8164.971428571429
[UPDATE], 137000, 41426.42857142857
[UPDATE], 138000, 4448.36
[UPDATE], 139000, 5253.214285714285
[UPDATE], 140000, 58477.558139534885
[UPDATE], 141000, 7660.425
[UPDATE], 142000, 4456.944444444444
[UPDATE], 143000, 1836.4
[SCAN], Operations, 94963
[SCAN], AverageLatency(us), 90720.59563198299
[SCAN], MinLatency(us), 1169
[SCAN], MaxLatency(us), 4955844
[SCAN], Return=OK, 94964
[SCAN], 0, 2462305.722222222
[SCAN], 1000, 855498.7857142857
[SCAN], 2000, 131640.80114722752
[SCAN], 3000, 87762.81845688351
[SCAN], 4000, 74124.33067729084
[SCAN], 5000, 67838.86852085967
[SCAN], 6000, 61465.94438006952
[SCAN], 7000, 92156.39165329053
[SCAN], 8000, 84756.50884955752
[SCAN], 9000, 114871.08043875685
[SCAN], 10000, 99082.31841652324
[SCAN], 11000, 114329.17821782178
[SCAN], 12000, 120827.67052023122
[SCAN], 13000, 116527.31506849315
[SCAN], 14000, 75168.16707920792
[SCAN], 15000, 95245.77392739274
[SCAN], 16000, 96373.40650406505
[SCAN], 17000, 100127.46787479406
[SCAN], 18000, 95155.79873217116
[SCAN], 19000, 85219.45371775418
[SCAN], 20000, 96809.76827371695
[SCAN], 21000, 83678.63715529753
[SCAN], 22000, 100643.10837438423
[SCAN], 23000, 65895.93020719738
[SCAN], 24000, 74890.37865311309
[SCAN], 25000, 81959.01886792453
[SCAN], 26000, 90196.69696969698
[SCAN], 27000, 101143.04944178628
[SCAN], 28000, 96323.3399339934
[SCAN], 29000, 87420.55913978495
[SCAN], 30000, 106730.35334476845
[SCAN], 31000, 87152.89153046062
[SCAN], 32000, 79443.08367626886
[SCAN], 33000, 76819.09023485785
[SCAN], 34000, 65056.40935672515
[SCAN], 35000, 80349.93928128872
[SCAN], 36000, 57687.82997987927
[SCAN], 37000, 79737.1949602122
[SCAN], 38000, 69121.00917431193
[SCAN], 39000, 86310.0406626506
[SCAN], 40000, 94089.66515151515
[SCAN], 41000, 102182.00342465754
[SCAN], 42000, 90674.96012759171
[SCAN], 43000, 111600.79238095238
[SCAN], 44000, 95378.85714285714
[SCAN], 45000, 114821.85585585586
[SCAN], 46000, 93830.0870967742
[SCAN], 47000, 92002.47259259259
[SCAN], 48000, 82430.31284916202
[SCAN], 49000, 107842.7495527728
[SCAN], 50000, 83144.51311953353
[SCAN], 51000, 103355.5602006689
[SCAN], 52000, 100755.83082077051
[SCAN], 53000, 90563.29093799682
[SCAN], 54000, 114398.10556621882
[SCAN], 55000, 91034.50574712643
[SCAN], 56000, 74674.03162055336
[SCAN], 57000, 149296.443877551
[SCAN], 58000, 79952.5625
[SCAN], 59000, 90403.56083086053
[SCAN], 60000, 82226.97976878613
[SCAN], 61000, 98776.09335443038
[SCAN], 62000, 70794.52142857143
[SCAN], 63000, 78497.84880636605
[SCAN], 64000, 67409.62262038075
[SCAN], 65000, 76437.44210526315
[SCAN], 66000, 69734.54138702461
[SCAN], 67000, 88634.97217928902
[SCAN], 68000, 80377.4027972028
[SCAN], 69000, 100656.54777070064
[SCAN], 70000, 101103.84536082474
[SCAN], 71000, 77095.96883116884
[SCAN], 72000, 82145.03566333809
[SCAN], 73000, 73585.42420681551
[SCAN], 74000, 86280.89518413598
[SCAN], 75000, 81428.83623188405
[SCAN], 76000, 94536.35714285714
[SCAN], 77000, 93093.50392464678
[SCAN], 78000, 93884.33848531685
[SCAN], 79000, 83517.94759825327
[SCAN], 80000, 100242.98076923077
[SCAN], 81000, 97481.29918699188
[SCAN], 82000, 86287.81749622925
[SCAN], 83000, 112052.35859519409
[SCAN], 84000, 125674.9188034188
[SCAN], 85000, 98160.14761904762
[SCAN], 86000, 85025.43815201192
[SCAN], 87000, 107169.56916996048
[SCAN], 88000, 89481.69818652849
[SCAN], 89000, 86176.74386503067
[SCAN], 90000, 102496.44844517185
[SCAN], 91000, 107317.94499017682
[SCAN], 92000, 84981.39973614775
[SCAN], 93000, 74301.01330108827
[SCAN], 94000, 86720.72714078374
[SCAN], 95000, 67247.55400696864
[SCAN], 96000, 83379.53698630138
[SCAN], 97000, 102001.5250431779
[SCAN], 98000, 73474.97323600973
[SCAN], 99000, 91982.94276094277
[SCAN], 100000, 115190.15384615384
[SCAN], 101000, 90177.10244648319
[SCAN], 102000, 96081.73742138364
[SCAN], 103000, 103311.64869565217
[SCAN], 104000, 75759.69887076537
[SCAN], 105000, 72149.59300873907
[SCAN], 106000, 79050.54749340369
[SCAN], 107000, 74588.49433962264
[SCAN], 108000, 80521.45874125874
[SCAN], 109000, 108885.48381601363
[SCAN], 110000, 75791.45623342175
[SCAN], 111000, 106895.64310954063
[SCAN], 112000, 90439.28484848485
[SCAN], 113000, 84819.49368863954
[SCAN], 114000, 77394.51826792964
[SCAN], 115000, 95323.40358744394
[SCAN], 116000, 91002.98534201954
[SCAN], 117000, 105028.57142857143
[SCAN], 118000, 70172.7795765878
[SCAN], 119000, 90085.50337381917
[SCAN], 120000, 85877.52394775036
[SCAN], 121000, 85804.85758039817
[SCAN], 122000, 80222.03316326531
[SCAN], 123000, 83590.94910591471
[SCAN], 124000, 70285.01895734596
[SCAN], 125000, 84971.60058737152
[SCAN], 126000, 77493.05387647831
[SCAN], 127000, 82425.71690140845
[SCAN], 128000, 111154.0796460177
[SCAN], 129000, 108841.48648648648
[SCAN], 130000, 123187.94181034483
[SCAN], 131000, 110605.17383512545
[SCAN], 132000, 80273.97014925373
[SCAN], 133000, 94552.75119617225
[SCAN], 134000, 90106.91297709923
[SCAN], 135000, 88144.89606741573
[SCAN], 136000, 111391.13714285714
[SCAN], 137000, 119886.244
[SCAN], 138000, 94736.44483362522
[SCAN], 139000, 74699.97891963109
[SCAN], 140000, 91141.51449275362
[SCAN], 141000, 73193.8187599364
[SCAN], 142000, 37303.072289156626
[SCAN], 143000, 12575.78698224852